In [28]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv('titanic.csv')

In [6]:
df

      Unnamed: 0 Cabin Embarked      Fare  ...  Parch     Sex  SibSp Survived
0              0   NaN        S    7.2500  ...      0    male      1      0.0
1              1   C85        C   71.2833  ...      0  female      1      1.0
2              2   NaN        S    7.9250  ...      0  female      0      1.0
3              3  C123        S   53.1000  ...      0  female      1      1.0
4              4   NaN        S    8.0500  ...      0    male      0      0.0
...          ...   ...      ...       ...  ...    ...     ...    ...      ...
1304        1304   NaN        S    8.0500  ...      0    male      0      NaN
1305        1305  C105        C  108.9000  ...      0  female      0      NaN
1306        1306   NaN        S    7.2500  ...      0    male      0      NaN
1307        1307   NaN        S    8.0500  ...      0    male      0      NaN
1308        1308   NaN        C   22.3583  ...      1    male      1      NaN

[1309 rows x 12 columns]

In [7]:
df.head()

   Unnamed: 0 Cabin Embarked     Fare  ...  Parch     Sex  SibSp Survived
0           0   NaN        S   7.2500  ...      0    male      1      0.0
1           1   C85        C  71.2833  ...      0  female      1      1.0
2           2   NaN        S   7.9250  ...      0  female      0      1.0
3           3  C123        S  53.1000  ...      0  female      1      1.0
4           4   NaN        S   8.0500  ...      0    male      0      0.0

[5 rows x 12 columns]

In [8]:
df['Age']

0       22.0
1       38.0
2       26.0
3       35.0
4       35.0
        ...
1304     NaN
1305    39.0
1306    38.5
1307     NaN
1308     NaN
Name: Age, Length: 1309, dtype: float64

In [9]:
df[['Name', 'Parch', 'Sex']]

                                                   Name  Parch     Sex
0                               Braund, Mr. Owen Harris      0    male
1     Cumings, Mrs. John Bradley (Florence Briggs Th...      0  female
2                                Heikkinen, Miss. Laina      0  female
3          Futrelle, Mrs. Jacques Heath (Lily May Peel)      0  female
4                              Allen, Mr. William Henry      0    male
...                                                 ...    ...     ...
1304                                 Spector, Mr. Woolf      0    male
1305                       Oliva y Ocana, Dona. Fermina      0  female
1306                       Saether, Mr. Simon Sivertsen      0    male
1307                                Ware, Mr. Frederick      0    male
1308                           Peter, Master. Michael J      1    male

[1309 rows x 3 columns]

In [10]:
df.iloc[0]

Unnamed: 0                          0
Cabin                             NaN
Embarked                            S
Fare                             7.25
Pclass                              3
Ticket                      A/5 21171
Age                                22
Name          Braund, Mr. Owen Harris
Parch                               0
Sex                              male
SibSp                               1
Survived                            0
Name: 0, dtype: object

In [11]:
df.iloc[[0,1,2]]

   Unnamed: 0 Cabin Embarked     Fare  ...  Parch     Sex  SibSp Survived
0           0   NaN        S   7.2500  ...      0    male      1      0.0
1           1   C85        C  71.2833  ...      0  female      1      1.0
2           2   NaN        S   7.9250  ...      0  female      0      1.0

[3 rows x 12 columns]

In [12]:
columns = df.columns # Extract the list of columns
print(columns)

Index(['Unnamed: 0', 'Cabin', 'Embarked', 'Fare', 'Pclass', 'Ticket', 'Age',
       'Name', 'Parch', 'Sex', 'SibSp', 'Survived'],
      dtype='object')

In [13]:
df[columns[1:4]] # Columns 2, 3, 4

     Cabin Embarked      Fare
0      NaN        S    7.2500
1      C85        C   71.2833
2      NaN        S    7.9250
3     C123        S   53.1000
4      NaN        S    8.0500
...    ...      ...       ...
1304   NaN        S    8.0500
1305  C105        C  108.9000
1306   NaN        S    7.2500
1307   NaN        S    8.0500
1308   NaN        C   22.3583

[1309 rows x 3 columns]

In [14]:
child_passengers = df[df.Age < 21][['Name', 'Age']]
child_passengers.head()

                                    Name   Age
7         Palsson, Master. Gosta Leonard   2.0
9    Nasser, Mrs. Nicholas (Adele Achem)  14.0
10       Sandstrom, Miss. Marguerite Rut   4.0
12        Saundercock, Mr. William Henry  20.0
14  Vestrom, Miss. Hulda Amanda Adolfina  14.0

In [16]:
young_adult_passengers = df.loc[
 (df.Age > 21) & (df.Age < 30)
]

In [17]:
young_adult_passengers.head()

    Unnamed: 0 Cabin Embarked     Fare  ...  Parch     Sex  SibSp Survived
0            0   NaN        S   7.2500  ...      0    male      1      0.0
2            2   NaN        S   7.9250  ...      0  female      0      1.0
8            8   NaN        S  11.1333  ...      2  female      0      1.0
23          23    A6        S  35.5000  ...      0    male      0      1.0
34          34   NaN        C  82.1708  ...      0    male      1      0.0

[5 rows x 12 columns]

In [18]:
del df['Unnamed: 0']
df.head()

  Cabin Embarked     Fare  Pclass  ... Parch     Sex SibSp  Survived
0   NaN        S   7.2500       3  ...     0    male     1       0.0
1   C85        C  71.2833       1  ...     0  female     1       1.0
2   NaN        S   7.9250       3  ...     0  female     0       1.0
3  C123        S  53.1000       1  ...     0  female     1       1.0
4   NaN        S   8.0500       3  ...     0    male     0       0.0

[5 rows x 11 columns]

In [19]:
df.describe()

              Fare       Pclass  ...        SibSp    Survived
count  1308.000000  1309.000000  ...  1309.000000  891.000000
mean     33.295479     2.294882  ...     0.498854    0.383838
std      51.758668     0.837836  ...     1.041658    0.486592
min       0.000000     1.000000  ...     0.000000    0.000000
25%       7.895800     2.000000  ...     0.000000    0.000000
50%      14.454200     3.000000  ...     0.000000    0.000000
75%      31.275000     3.000000  ...     1.000000    1.000000
max     512.329200     3.000000  ...     8.000000    1.000000

[8 rows x 6 columns]

In [20]:
df.count()

Cabin        295
Embarked    1307
Fare        1308
Pclass      1309
Ticket      1309
Age         1046
Name        1309
Parch       1309
Sex         1309
SibSp       1309
Survived     891
dtype: int64

In [21]:
df.describe(include='all')

              Cabin Embarked         Fare  ...   Sex        SibSp    Survived
count           295     1307  1308.000000  ...  1309  1309.000000  891.000000
unique          186        3          NaN  ...     2          NaN         NaN
top     C23 C25 C27        S          NaN  ...  male          NaN         NaN
freq              6      914          NaN  ...   843          NaN         NaN
mean            NaN      NaN    33.295479  ...   NaN     0.498854    0.383838
std             NaN      NaN    51.758668  ...   NaN     1.041658    0.486592
min             NaN      NaN     0.000000  ...   NaN     0.000000    0.000000
25%             NaN      NaN     7.895800  ...   NaN     0.000000    0.000000
50%             NaN      NaN    14.454200  ...   NaN     0.000000    0.000000
75%             NaN      NaN    31.275000  ...   NaN     1.000000    1.000000
max             NaN      NaN   512.329200  ...   NaN     8.000000    1.000000

[11 rows x 11 columns]

In [22]:
embarked_grouped = df.groupby('Embarked')
print(f'There are {len(embarked_grouped)} Embarked groups')

There are 3 Embarked groups

In [24]:
embarked_grouped.groups

{'C': [1, 9, 19, 26, 30, 31, 34, 36, 39, 42, 43, 48, 52, 54, 57, 60, 64, 65, 73, 96, 97, 111, 114, 118, 122, 125, 128, 130, 135, 139, 140, 155, 174, 177, 181, 194, 195, 203, 207, 209, 215, 218, 240, 244, 255, 256, 258, 273, 285, 291, 292, 295, 296, 299, 306, 307, 308, 309, 310, 311, 319, 325, 329, 337, 352, 354, 361, 362, 366, 367, 369, 370, 373, 375, 377, 378, 380, 381, 389, 393, 420, 448, 452, 453, 455, 469, 473, 484, 487, 493, 495, 496, 505, 513, 522, 523, 524, 531, 532, 533, ...], 'Q': [5, 16, 22, 28, 32, 44, 46, 47, 82, 109, 116, 126, 143, 156, 171, 186, 188, 196, 198, 208, 214, 241, 245, 260, 264, 274, 278, 280, 289, 300, 301, 303, 322, 330, 358, 359, 364, 368, 388, 411, 412, 421, 428, 459, 468, 501, 502, 510, 517, 525, 552, 560, 573, 593, 612, 613, 626, 629, 653, 654, 657, 680, 697, 703, 718, 727, 749, 767, 768, 776, 778, 787, 790, 825, 828, 885, 890, 891, 893, 897, 907, 938, 946, 954, 957, 961, 970, 975, 977, 979, 993, 997, 998, 1002, 1004, 1012, 1015, 1018, 1051, 1074, ...], 'S': [0, 2, 3, 4, 6, 7, 8, 10, 11, 12, 13, 14, 15, 17, 18, 20, 21, 23, 24, 25, 27, 29, 33, 35, 37, 38, 40, 41, 45, 49, 50, 51, 53, 55, 56, 58, 59, 62, 63, 66, 67, 68, 69, 70, 71, 72, 74, 75, 76, 77, 78, 79, 80, 81, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 110, 112, 113, 115, 117, 119, 120, 121, 123, 124, 127, 129, 131, 132, 133, 134, 136, 137, 138, 141, 142, 144, ...]}

In [29]:
for name, group in embarked_grouped:
 print(name, group.Age.mean())

C 32.33216981132075
Q 28.63
S 29.245204603580564

In [30]:
embarked_grouped.agg(np.mean)

               Fare    Pclass        Age     Parch     SibSp  Survived
Embarked
C         62.336267  1.851852  32.332170  0.370370  0.400000  0.553571
Q         12.409012  2.894309  28.630000  0.113821  0.341463  0.389610
S         27.418824  2.347921  29.245205  0.426696  0.550328  0.336957

In [31]:
embarked_grouped.agg(lambda x: x.values[0])

         Cabin     Fare  Pclass     Ticket  ...  Parch     Sex  SibSp Survived
Embarked                                    ...
C          C85  71.2833       1   PC 17599  ...      0  female      1      1.0
Q          NaN   8.4583       3     330877  ...      0    male      0      0.0
S          NaN   7.2500       3  A/5 21171  ...      0    male      1      0.0

[3 rows x 10 columns]

In [32]:
age_embarked_grouped = df.groupby(['Sex', 'Embarked'])
age_embarked_grouped.groups

{('male', 'S'): [0, 4, 6, 7, 12, 13, 17, 20, 21, 23, 27, 29, 33, 35, 37, 45, 50, 51, 55, 59, 62, 63, 67, 69, 70, 72, 74, 75, 76, 77, 78, 80, 81, 83, 86, 87, 89, 90, 91, 92, 93, 94, 95, 99, 101, 102, 103, 104, 105, 107, 108, 110, 112, 115, 117, 120, 121, 124, 127, 129, 131, 134, 137, 138, 144, 145, 146, 148, 149, 150, 152, 153, 154, 157, 158, 159, 160, 162, 163, 164, 165, 168, 169, 170, 173, 175, 176, 178, 179, 182, 183, 185, 187, 189, 191, 193, 197, 200, 201, 202, ...], ('female', 'C'): [1, 9, 19, 31, 39, 43, 52, 111, 114, 128, 140, 177, 194, 195, 215, 218, 240, 255, 256, 258, 291, 299, 306, 307, 309, 310, 311, 319, 325, 329, 337, 362, 366, 367, 369, 375, 380, 381, 389, 393, 448, 469, 473, 496, 513, 523, 533, 537, 539, 556, 578, 581, 591, 608, 641, 644, 691, 700, 702, 710, 716, 742, 780, 830, 835, 842, 849, 852, 858, 866, 874, 875, 879, 899, 906, 910, 915, 917, 939, 950, 965, 991, 995, 1003, 1013, 1041, 1059, 1070, 1075, 1099, 1109, 1111, 1115, 1116, 1130, 1131, 1140, 1163, 1174, 1187, ...], ('female', 'S'): [2, 3, 8, 10, 11, 14, 15, 18, 24, 25, 38, 40, 41, 49, 53, 56, 58, 66, 68, 71, 79, 84, 85, 88, 98, 100, 106, 113, 119, 123, 132, 133, 136, 141, 142, 147, 151, 161, 166, 167, 172, 180, 184, 190, 192, 199, 205, 211, 216, 229, 230, 233, 235, 237, 246, 247, 251, 254, 257, 259, 268, 269, 272, 275, 276, 279, 290, 293, 297, 312, 315, 316, 318, 323, 327, 328, 334, 341, 345, 346, 347, 356, 357, 374, 376, 383, 387, 394, 396, 399, 402, 404, 409, 415, 416, 417, 419, 423, 426, 427, ...], ('male', 'Q'): [5, 16, 46, 116, 126, 143, 171, 188, 196, 214, 245, 260, 278, 280, 301, 364, 388, 411, 421, 428, 459, 468, 510, 517, 525, 552, 560, 613, 626, 629, 703, 718, 749, 768, 776, 778, 787, 790, 825, 828, 890, 891, 893, 907, 938, 946, 975, 993, 997, 998, 1012, 1015, 1074, 1084, 1124, 1147, 1162, 1249, 1271, 1272, 1279, 1287, 1290], ('female', 'Q'): [22, 28, 32, 44, 47, 82, 109, 156, 186, 198, 208, 241, 264, 274, 289, 300, 303, 322, 330, 358, 359, 368, 412, 501, 502, 573, 593, 612, 653, 654, 657, 680, 697, 727, 767, 885, 897, 954, 957, 961, 970, 977, 979, 1002, 1004, 1018, 1051, 1091, 1097, 1107, 1118, 1164, 1173, 1182, 1195, 1204, 1206, 1299, 1301, 1302], ('male', 'C'): [26, 30, 34, 36, 42, 48, 54, 57, 60, 64, 65, 73, 96, 97, 118, 122, 125, 130, 135, 139, 155, 174, 181, 203, 207, 209, 244, 273, 285, 292, 295, 296, 308, 352, 354, 361, 370, 373, 377, 378, 420, 452, 453, 455, 484, 487, 493, 495, 505, 522, 524, 531, 532, 544, 547, 550, 553, 557, 568, 583, 584, 587, 598, 599, 604, 620, 622, 632, 645, 647, 659, 661, 679, 681, 685, 693, 698, 709, 731, 737, 762, 766, 773, 789, 793, 798, 803, 817, 827, 832, 839, 843, 847, 859, 889, 908, 911, 914, 918, 920, ...], ('female', nan): [61, 829]}

In [33]:
df.aggregate(lambda x: x.isna().sum())

Cabin       1014
Embarked       2
Fare           1
Pclass         0
Ticket         0
Age          263
Name           0
Parch          0
Sex            0
SibSp          0
Survived     418
dtype: int64

In [34]:
df_valid = df.loc[(~df.Embarked.isna()) & (~df.Fare.isna())]

In [35]:
df_valid

     Cabin Embarked      Fare  Pclass  ... Parch     Sex SibSp  Survived
0      NaN        S    7.2500       3  ...     0    male     1       0.0
1      C85        C   71.2833       1  ...     0  female     1       1.0
2      NaN        S    7.9250       3  ...     0  female     0       1.0
3     C123        S   53.1000       1  ...     0  female     1       1.0
4      NaN        S    8.0500       3  ...     0    male     0       0.0
...    ...      ...       ...     ...  ...   ...     ...   ...       ...
1304   NaN        S    8.0500       3  ...     0    male     0       NaN
1305  C105        C  108.9000       1  ...     0  female     0       NaN
1306   NaN        S    7.2500       3  ...     0    male     0       NaN
1307   NaN        S    8.0500       3  ...     0    male     0       NaN
1308   NaN        C   22.3583       3  ...     1    male     1       NaN

[1306 rows x 11 columns]

In [38]:
df_valid[['Age']] = df_valid[['Age']].fillna(df_valid.Age.mean())

/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:3069: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[k1] = value[k2]

In [39]:
mean_ages = df_valid.groupby(['Pclass', 'Sex'])['Age'].\
 transform(lambda x: x.fillna(x.mean()))
df_valid.loc[:, 'Age'] = mean_ages

/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:1743: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(ilocs[0], value)

In [41]:
mean_ages = df_valid.groupby(['Pclass', 'Sex'])['Age'].\
 transform(lambda x: x.fillna(x.mean()))

In [43]:
df_valid.loc[:, 'Age'] = mean_ages

/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:1743: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(ilocs[0], value)